IDEA Open Model
ConcreteMemberData.MemberType Property
 Gets or sets the structural type of member.
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public ConcreteMemberType MemberType { get; set; }
Public Property MemberType As ConcreteMemberType
	Get
	Set
public:
property ConcreteMemberType MemberType {
	ConcreteMemberType get ();
	void set (ConcreteMemberType value);
}
Property Value
Type: ConcreteMemberType
See Also
Reference
ConcreteMemberData Class
IdeaRS.OpenModel.Concrete Namespace